01.	安装CornerStone
================================================================================

02. 具体操作
================================================================================
1>  添加远程代码仓库
2>  到处代码库到本地
3>  在本地目录下使用Xcode新建项目
注意：不要勾选 git，两套源代码管理同时存在会发生冲突

4>  升级SVN版本库
5>  退出Xcode
6>  在CornerStone中忽略个人用户文件"xcuserdata"，否则每次都要提交，非常繁琐！
提示：xcuserdata目录中为保留用户上次打开的文件，调试设置的断点等信息

7>  在CornerStone中提交项目

8>  其他用户操作

03.	SVN演练
================================================================================

1>  修改文件
2>  修改Storyboard
3>  合并冲突（仅在两个人同时修改一行代码时，才会出现冲突）

04.	多Storyboard
================================================================================
1>  多Storyboard在项目开发中的应用技巧
2>  自动布局小结

界面上任何一个控件，都可以"参照"其他控件的位置准确定位位置

通过自动布局的约束，能够设置出控件的frame => x, y, width, height
Xcode 6中很多控件的 x,y 值可以省略

在Storyboard中使用自动布局的技巧
(1)     先摆好所有控件的所在位置
(2)     通过Pin设置控件与其他控件的"参照"位置
(3)     通过Align设置控件与其他空间的"参照"对齐方式
(4)     尽量把一组相关的控件包装在子视图内，这样在设置自动布局时，只需要指定大的子视图之间的约束关系就可以了

自动布局中的错误信息
红色错误：如果指定的约束不完整->不能准确定位视图位置
黄色警告：如果指定的约束定位的位置，与控件在Storyboard的实际摆放位置不一致，会提示警告信息

05.	分支演练
================================================================================


